retry mermind
